apps/web/billing/spec/fixtures/vcr_cassettes/Onetime_CLI_BillingInvoicesCommand/with/displays_total_count_of_invoices.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/products
    body:
      encoding: UTF-8
      string: name=Test+Product+1766640448
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_idT48oWfvfF0DD","request_duration_ms":907}}'
      Idempotency-Key:
      - 1766640448-54e1498b-710f-4c9e-bd70-a4d056fa513c
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:27:28 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '473'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=F88qQ5akjx73ZK8RQfHHPtkgIEqjYsYkdAvJhoW-H2iETR047d2ymDFKlLc2uXKne4ENiHCTBtJRXMT5
      Idempotency-Key:
      - 1766640448-54e1498b-710f-4c9e-bd70-a4d056fa513c
      Original-Request:
      - req_v0KBtOJwORTwbj
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "prod_TfRzkEz6f89ntI",
          "object": "product",
          "active": true,
          "attributes": [],
          "created": 1766640448,
          "default_price": null,
          "description": null,
          "images": [],
          "livemode": false,
          "marketing_features": [],
          "metadata": {},
          "name": "Test Product 1766640448",
          "package_dimensions": null,
          "shippable": null,
          "statement_descriptor": null,
          "tax_code": null,
          "type": "service",
          "unit_label": null,
          "updated": 1766640448,
          "url": null
        }
  recorded_at: Thu, 25 Dec 2025 05:27:28 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/prices
    body:
      encoding: UTF-8
      string: unit_amount=5000&currency=usd&product=prod_TfRzkEz6f89ntI
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_v0KBtOJwORTwbj","request_duration_ms":367}}'
      Idempotency-Key:
      - 1766640448-70461a8f-a71a-464c-a5d2-2517c84ef66e
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:27:28 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '492'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=F88qQ5akjx73ZK8RQfHHPtkgIEqjYsYkdAvJhoW-H2iETR047d2ymDFKlLc2uXKne4ENiHCTBtJRXMT5
      Idempotency-Key:
      - 1766640448-70461a8f-a71a-464c-a5d2-2517c84ef66e
      Original-Request:
      - req_jsrVv57J1cvSZv
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "price_1Si75AH54PcLeqtYvVK1TUFa",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1766640448,
          "currency": "usd",
          "custom_unit_amount": null,
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_TfRzkEz6f89ntI",
          "recurring": null,
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "one_time",
          "unit_amount": 5000,
          "unit_amount_decimal": "5000"
        }
  recorded_at: Thu, 25 Dec 2025 05:27:28 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: UTF-8
      string: customer=cus_TfRz2WIEBtXc5V&price=price_1Si75AH54PcLeqtYvVK1TUFa
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_jsrVv57J1cvSZv","request_duration_ms":369}}'
      Idempotency-Key:
      - 1766640448-f90c913b-fe5f-41e2-b7d5-1c4b121ccec5
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:27:29 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '356'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=F88qQ5akjx73ZK8RQfHHPtkgIEqjYsYkdAvJhoW-H2iETR047d2ymDFKlLc2uXKne4ENiHCTBtJRXMT5
      Idempotency-Key:
      - 1766640448-f90c913b-fe5f-41e2-b7d5-1c4b121ccec5
      Original-Request:
      - req_bBXVLbcydjsjtg
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "code": "parameter_unknown",
            "doc_url": "https://stripe.com/docs/error-codes/parameter-unknown",
            "message": "Received unknown parameter: price. Did you mean pricing?",
            "param": "price",
            "request_log_url": "https://dashboard.stripe.com/test/logs/req_bBXVLbcydjsjtg?t=1766640448",
            "type": "invalid_request_error"
          }
        }
  recorded_at: Thu, 25 Dec 2025 05:27:29 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=invoice-test%40example.com
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_fV5l45PV7ipCv7","request_duration_ms":953}}'
      Idempotency-Key:
      - 1766640542-19ba5feb-b552-4c42-8de4-c766d529f626
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:29:03 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '664'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=wiLr7t4hVWJe9hNLk5WWrUi99liUFOgqPE1b5JCntt68Uv1Jh3pG5uubR_BSKshc1gorx-ePYLpanx7t
      Idempotency-Key:
      - 1766640542-19ba5feb-b552-4c42-8de4-c766d529f626
      Original-Request:
      - req_4b5VbgmUzgg4Bt
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "cus_TfS0ijWGVx888V",
          "object": "customer",
          "address": null,
          "balance": 0,
          "created": 1766640542,
          "currency": null,
          "customer_account": null,
          "default_source": null,
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "invoice-test@example.com",
          "invoice_prefix": "EY97GXJM",
          "invoice_settings": {
            "custom_fields": null,
            "default_payment_method": null,
            "footer": null,
            "rendering_options": null
          },
          "livemode": false,
          "metadata": {},
          "name": null,
          "next_invoice_sequence": 1,
          "phone": null,
          "preferred_locales": [],
          "shipping": null,
          "tax_exempt": "none",
          "test_clock": null
        }
  recorded_at: Thu, 25 Dec 2025 05:29:03 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/products
    body:
      encoding: UTF-8
      string: name=Test+Product+1766640543
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_4b5VbgmUzgg4Bt","request_duration_ms":755}}'
      Idempotency-Key:
      - 1766640543-098a360e-5195-470c-8d77-701dbc7cc9fb
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:29:03 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '473'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=wiLr7t4hVWJe9hNLk5WWrUi99liUFOgqPE1b5JCntt68Uv1Jh3pG5uubR_BSKshc1gorx-ePYLpanx7t
      Idempotency-Key:
      - 1766640543-098a360e-5195-470c-8d77-701dbc7cc9fb
      Original-Request:
      - req_ZoTd5HDKzJYc9W
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "prod_TfS0I9hjt7OQbm",
          "object": "product",
          "active": true,
          "attributes": [],
          "created": 1766640543,
          "default_price": null,
          "description": null,
          "images": [],
          "livemode": false,
          "marketing_features": [],
          "metadata": {},
          "name": "Test Product 1766640543",
          "package_dimensions": null,
          "shippable": null,
          "statement_descriptor": null,
          "tax_code": null,
          "type": "service",
          "unit_label": null,
          "updated": 1766640543,
          "url": null
        }
  recorded_at: Thu, 25 Dec 2025 05:29:03 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/prices
    body:
      encoding: UTF-8
      string: unit_amount=5000&currency=usd&product=prod_TfS0I9hjt7OQbm
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_ZoTd5HDKzJYc9W","request_duration_ms":361}}'
      Idempotency-Key:
      - 1766640543-520bddf8-efa0-4b88-a347-2b7b5868745f
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:29:03 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '492'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=wiLr7t4hVWJe9hNLk5WWrUi99liUFOgqPE1b5JCntt68Uv1Jh3pG5uubR_BSKshc1gorx-ePYLpanx7t
      Idempotency-Key:
      - 1766640543-520bddf8-efa0-4b88-a347-2b7b5868745f
      Original-Request:
      - req_dW9LLphpB5OkJK
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "price_1Si76hH54PcLeqtYkBJwsVgC",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1766640543,
          "currency": "usd",
          "custom_unit_amount": null,
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_TfS0I9hjt7OQbm",
          "recurring": null,
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "one_time",
          "unit_amount": 5000,
          "unit_amount_decimal": "5000"
        }
  recorded_at: Thu, 25 Dec 2025 05:29:03 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: UTF-8
      string: customer=cus_TfS0ijWGVx888V&price=price_1Si76hH54PcLeqtYkBJwsVgC
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_dW9LLphpB5OkJK","request_duration_ms":358}}'
      Idempotency-Key:
      - 1766640543-2ae2da36-4176-483c-a4e8-0279db435d91
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:29:04 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '356'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=wiLr7t4hVWJe9hNLk5WWrUi99liUFOgqPE1b5JCntt68Uv1Jh3pG5uubR_BSKshc1gorx-ePYLpanx7t
      Idempotency-Key:
      - 1766640543-2ae2da36-4176-483c-a4e8-0279db435d91
      Original-Request:
      - req_uQaDw49LfNmIZF
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "code": "parameter_unknown",
            "doc_url": "https://stripe.com/docs/error-codes/parameter-unknown",
            "message": "Received unknown parameter: price. Did you mean pricing?",
            "param": "price",
            "request_log_url": "https://dashboard.stripe.com/test/logs/req_uQaDw49LfNmIZF?t=1766640544",
            "type": "invalid_request_error"
          }
        }
  recorded_at: Thu, 25 Dec 2025 05:29:04 GMT
recorded_with: VCR 6.3.1
