apps/web/billing/spec/fixtures/vcr_cassettes/Onetime_CLI_BillingInvoicesCommand/with/formats_amounts_correctly.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/products
    body:
      encoding: UTF-8
      string: name=Test+Product+1766640435
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_sYm5qZ0t6IGsUo","request_duration_ms":796}}'
      Idempotency-Key:
      - 1766640435-a80badbb-0870-4c85-920d-d0d4faa2e0da
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:27:16 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '473'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=ihwIG_Yg0zS3RHBlDYCNp1kJCR7avED0bpywqO4q4geqiDDk_mS2GS2hSzP1-CdlZL2_lMCAAdcz6T8s
      Idempotency-Key:
      - 1766640435-a80badbb-0870-4c85-920d-d0d4faa2e0da
      Original-Request:
      - req_JkFxtmnNEYVYIA
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "prod_TfRyN1HXrjClD7",
          "object": "product",
          "active": true,
          "attributes": [],
          "created": 1766640435,
          "default_price": null,
          "description": null,
          "images": [],
          "livemode": false,
          "marketing_features": [],
          "metadata": {},
          "name": "Test Product 1766640435",
          "package_dimensions": null,
          "shippable": null,
          "statement_descriptor": null,
          "tax_code": null,
          "type": "service",
          "unit_label": null,
          "updated": 1766640435,
          "url": null
        }
  recorded_at: Thu, 25 Dec 2025 05:27:16 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/prices
    body:
      encoding: UTF-8
      string: unit_amount=5000&currency=usd&product=prod_TfRyN1HXrjClD7
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_JkFxtmnNEYVYIA","request_duration_ms":374}}'
      Idempotency-Key:
      - 1766640436-41a88e50-87ec-41a6-b393-ba04780fdde9
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:27:16 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '492'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=ihwIG_Yg0zS3RHBlDYCNp1kJCR7avED0bpywqO4q4geqiDDk_mS2GS2hSzP1-CdlZL2_lMCAAdcz6T8s
      Idempotency-Key:
      - 1766640436-41a88e50-87ec-41a6-b393-ba04780fdde9
      Original-Request:
      - req_6wOFRfygiJhwWN
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "price_1Si74yH54PcLeqtYO5Gv3oxn",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1766640436,
          "currency": "usd",
          "custom_unit_amount": null,
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_TfRyN1HXrjClD7",
          "recurring": null,
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "one_time",
          "unit_amount": 5000,
          "unit_amount_decimal": "5000"
        }
  recorded_at: Thu, 25 Dec 2025 05:27:16 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: UTF-8
      string: customer=cus_TfRyiOOvmBeDNV&price=price_1Si74yH54PcLeqtYO5Gv3oxn
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_6wOFRfygiJhwWN","request_duration_ms":376}}'
      Idempotency-Key:
      - 1766640436-d285b6b1-c300-42ee-92fb-246549602bbe
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:27:16 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '356'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=ihwIG_Yg0zS3RHBlDYCNp1kJCR7avED0bpywqO4q4geqiDDk_mS2GS2hSzP1-CdlZL2_lMCAAdcz6T8s
      Idempotency-Key:
      - 1766640436-d285b6b1-c300-42ee-92fb-246549602bbe
      Original-Request:
      - req_6zCrJJLkSrLr18
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "code": "parameter_unknown",
            "doc_url": "https://stripe.com/docs/error-codes/parameter-unknown",
            "message": "Received unknown parameter: price. Did you mean pricing?",
            "param": "price",
            "request_log_url": "https://dashboard.stripe.com/test/logs/req_6zCrJJLkSrLr18?t=1766640436",
            "type": "invalid_request_error"
          }
        }
  recorded_at: Thu, 25 Dec 2025 05:27:16 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=invoice-test%40example.com
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      Idempotency-Key:
      - 1766640534-250008b2-20c1-4460-abfa-a68c24011dea
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:28:55 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '664'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=-ot0LtWxRMwEasAcFtkFz_OdVFCuFNPBHAShy7VFhc3eo8ezm56FOLmJhe9zF1j4YQzAtouQAsekH9Wm
      Idempotency-Key:
      - 1766640534-250008b2-20c1-4460-abfa-a68c24011dea
      Original-Request:
      - req_KpmpAzaKYdOupF
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "cus_TfS0h4MhNA4QY2",
          "object": "customer",
          "address": null,
          "balance": 0,
          "created": 1766640535,
          "currency": null,
          "customer_account": null,
          "default_source": null,
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "invoice-test@example.com",
          "invoice_prefix": "HUGOOGQR",
          "invoice_settings": {
            "custom_fields": null,
            "default_payment_method": null,
            "footer": null,
            "rendering_options": null
          },
          "livemode": false,
          "metadata": {},
          "name": null,
          "next_invoice_sequence": 1,
          "phone": null,
          "preferred_locales": [],
          "shipping": null,
          "tax_exempt": "none",
          "test_clock": null
        }
  recorded_at: Thu, 25 Dec 2025 05:28:55 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/products
    body:
      encoding: UTF-8
      string: name=Test+Product+1766640535
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_KpmpAzaKYdOupF","request_duration_ms":741}}'
      Idempotency-Key:
      - 1766640535-d8649bfd-0675-4c12-b6d8-c0cf1162480d
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:28:55 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '473'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=-ot0LtWxRMwEasAcFtkFz_OdVFCuFNPBHAShy7VFhc3eo8ezm56FOLmJhe9zF1j4YQzAtouQAsekH9Wm
      Idempotency-Key:
      - 1766640535-d8649bfd-0675-4c12-b6d8-c0cf1162480d
      Original-Request:
      - req_4JtUPTDFef40a2
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "prod_TfS0uujVU8oU0H",
          "object": "product",
          "active": true,
          "attributes": [],
          "created": 1766640535,
          "default_price": null,
          "description": null,
          "images": [],
          "livemode": false,
          "marketing_features": [],
          "metadata": {},
          "name": "Test Product 1766640535",
          "package_dimensions": null,
          "shippable": null,
          "statement_descriptor": null,
          "tax_code": null,
          "type": "service",
          "unit_label": null,
          "updated": 1766640535,
          "url": null
        }
  recorded_at: Thu, 25 Dec 2025 05:28:55 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/prices
    body:
      encoding: UTF-8
      string: unit_amount=5000&currency=usd&product=prod_TfS0uujVU8oU0H
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_4JtUPTDFef40a2","request_duration_ms":362}}'
      Idempotency-Key:
      - 1766640535-880cc5e9-37d1-476a-8bd3-0c9416b68cb0
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:28:55 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '492'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=-ot0LtWxRMwEasAcFtkFz_OdVFCuFNPBHAShy7VFhc3eo8ezm56FOLmJhe9zF1j4YQzAtouQAsekH9Wm
      Idempotency-Key:
      - 1766640535-880cc5e9-37d1-476a-8bd3-0c9416b68cb0
      Original-Request:
      - req_ogjXhto51GxB4k
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "price_1Si76ZH54PcLeqtYSPAgNyrF",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1766640535,
          "currency": "usd",
          "custom_unit_amount": null,
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_TfS0uujVU8oU0H",
          "recurring": null,
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "one_time",
          "unit_amount": 5000,
          "unit_amount_decimal": "5000"
        }
  recorded_at: Thu, 25 Dec 2025 05:28:55 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: UTF-8
      string: customer=cus_TfS0h4MhNA4QY2&price=price_1Si76ZH54PcLeqtYSPAgNyrF
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_ogjXhto51GxB4k","request_duration_ms":363}}'
      Idempotency-Key:
      - 1766640535-2bd2e2f0-59bd-4a4c-9d78-a059d3427ca7
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Stripe-Version:
      - "<STRIPE_VERSION>"
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 05:28:56 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '356'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=-ot0LtWxRMwEasAcFtkFz_OdVFCuFNPBHAShy7VFhc3eo8ezm56FOLmJhe9zF1j4YQzAtouQAsekH9Wm
      Idempotency-Key:
      - 1766640535-2bd2e2f0-59bd-4a4c-9d78-a059d3427ca7
      Original-Request:
      - req_B9Jt6Dc4DsfeXx
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "code": "parameter_unknown",
            "doc_url": "https://stripe.com/docs/error-codes/parameter-unknown",
            "message": "Received unknown parameter: price. Did you mean pricing?",
            "param": "price",
            "request_log_url": "https://dashboard.stripe.com/test/logs/req_B9Jt6Dc4DsfeXx?t=1766640536",
            "type": "invalid_request_error"
          }
        }
  recorded_at: Thu, 25 Dec 2025 05:28:56 GMT
recorded_with: VCR 6.3.1
